*** Bootstrap confidence interval
- Resampling engine:
  - np.random.choice()
#+BEGIN_SRC ipython :session :file  :exports both
  import numpy as np
  np.random.choice([1,2,3,4,5], size=4)
#+END_SRC

#+RESULTS:
: array([3, 5, 4, 1])
- Bootstrap replicate function

#+BEGIN_SRC ipython :session :file  :exports both
  def bootstrap_replicate_1d(data, func):
      bs_sample = np.random.choice(data, len(data))
      return func(bs_sample)
#+END_SRC

- Confidence interval of a statistic
  - if we repeat measurements over and over again, p% of the observered values would lie within the p% confidence interval
  - to get 95% confidence intervals
    - two tails: conf_int = np.percentile(bs_replicate, [2.5, 97.5])

